<div class="alert alert-block alert-info">
<b>Importation</b>
</div>

In [49]:
import pandas as pd

In [90]:
import matplotlib.pyplot as plt

<div class="alert alert-block alert-info">
<b>1. Faire les traitements nécessaires pour charger et fusionner les fichiers.</b>
</div>

In [51]:
df1=pd.read_csv(r'dataset_P1(Nov2013-June2014).csv',delimiter=";")
df1

      Customer_ID Date_purchase Price
0               1    02/11/2013    69
1               2    04/11/2013   350
2               3    05/11/2013    69
3               4    07/11/2013   120
4               5    07/11/2013   120
...           ...           ...   ...
6798         1716    13/03/2014   253
6799         1716    24/02/2014   507
6800         1716    05/04/2014   354
6801         1717    23/01/2014   788
6802         1717    01/02/2014   592

[6803 rows x 3 columns]

In [52]:
df2=pd.read_csv('dataset_P2(July2014-January2015).csv',delimiter=";")

In [53]:
df2.rename(columns={'m':'Price'},inplace=True) 
df2

      Customer_ID Date_purchase    Price
0              27    15/11/2014  4567,00
1              35    04/12/2014  4192,00
2              43    07/11/2014  5535,00
3              58    07/07/2014   362,00
4              58    29/09/2014   281,00
...           ...           ...      ...
5915         1715    26/08/2014   301,00
5916         1715    31/10/2014    35,00
5917         1715    27/09/2014    35,00
5918         1715    16/07/2014   248,00
5919         1715    11/12/2014   424,00

[5920 rows x 3 columns]

In [54]:
mydf=pd.concat([df1, df2], axis=0)
mydf.shape

(12723, 3)

<div class="alert alert-block alert-info">
<b>2. Pour chaque colonne donner le nombre de valeurs manquantes.</b>
</div>

In [55]:
mydf.isna().sum()

Customer_ID       0
Date_purchase    15
Price            12
dtype: int64

<div class="alert alert-block alert-info">
<b>3. Afficher un data frame avec toutes les lignes qui ont au moins une valeur manquante.</b>
</div>

In [56]:
mydf[mydf.isnull().any(axis=1)]

      Customer_ID Date_purchase Price
65             36           NaN   784
194            57    01/12/2013   NaN
230            64           NaN   NaN
278            74           NaN   444
318            77    01/03/2014   NaN
351            81           NaN   343
453            94           NaN   NaN
519           104           NaN    97
584           113           NaN    48
636           123    08/03/2014   NaN
693           131    22/01/2014   NaN
708           135    11/03/2014   NaN
738           139           NaN  6703
798           152           NaN   NaN
852           159           NaN   134
942           170           NaN   722
996           174    14/05/2014   NaN
1725          276           NaN   174
1791          285    12/03/2014   NaN
1861          298           NaN   153
1938          319    07/02/2014   NaN
2088          355    26/03/2014   NaN
2149          371           NaN   100
2208          387           NaN    66

<div class="alert alert-block alert-info">
<b>4. Supprimer ensuite toutes les lignes avec des valeurs manquantes.</b>
</div>

In [57]:
mydf['Date_purchase'] = pd.to_datetime(mydf['Date_purchase'],errors='coerce', format='%d/%m/%Y')

In [58]:
mydf.isna().sum()

Customer_ID       0
Date_purchase    27
Price            12
dtype: int64

In [59]:
mydf['Price']=pd.to_numeric(mydf['Price'].str.replace(',', '.'),errors='coerce')

In [60]:
mydf.dropna(inplace=True)

In [61]:
mydf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12686 entries, 0 to 5919
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Customer_ID    12686 non-null  int64
 1   Date_purchase  12686 non-null  datetime64[ns]
 2   Price          12686 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(1)
memory usage: 396.4 KB

In [62]:
mydf.isnull().sum()

Customer_ID      0
Date_purchase    0
Price            0
dtype: int64

In [63]:
mydf.isna().sum()

Customer_ID      0
Date_purchase    0
Price            0
dtype: int64

<div class="alert alert-block alert-info">
<b>5. Vérifier les dates des transactions afin de garder que celles qui sont effectuées par les
clients dans la période d’étude.</b>
</div>

In [64]:
mydf=mydf.loc[(mydf['Date_purchase'] >= '01/11/2013') & (mydf['Date_purchase'] <= pd.to_datetime('28/02/2015',format='%d/%m/%Y'))]

<div class="alert alert-block alert-info">
<b>6. Afficher les statistiques descriptives de base.</b>
</div>

In [91]:
mydf.describe()

        Customer_ID         Price
count  12686.000000  12686.000000
mean     739.337459    388.354801
std      465.789156    375.376216
min        1.000000     29.000000
25%      356.000000    150.000000
50%      632.000000    297.000000
75%     1122.000000    521.000000
max     1717.000000   7236.000000

In [66]:
#mydf['Date_purchase'] = pd.to_datetime(mydf['Date_purchase'],errors='coerce', format='%d/%m/%Y')

In [67]:
#f=mydf.loc[mydf['Price']==max(mydf['Price'])]

In [68]:
# c=f['Date_purchase'].dt.month
# c

<div class="alert alert-block alert-info">
<b>7. Vérifier s’il y a des valeurs aberrantes.</b>
</div>

In [69]:
mydf.boxplot()

<div class="alert alert-block alert-info">
<b>8. Quel est le mois qui a enregistré le plus grand nombre de ventes ? et quel est le montant
total de ce mois ?</b>
</div>

In [70]:
maxmois=mydf.groupby([(mydf['Date_purchase'].dt.month)])['Price'].agg('count').sort_values(ascending=False)

In [71]:
maxmois=maxmois.loc[max(maxmois)==maxmois]

In [72]:
maxmois

Date_purchase
11    1563
Name: Price, dtype: int64

<div class="alert alert-block alert-info">
<b>9. Afficher un graphe qui montre l’évolution du montant total par mois</b>
</div>

In [73]:
montant_total=mydf.groupby([(mydf['Date_purchase'].dt.month)])['Price'].agg('sum').sort_values(ascending=False)

In [74]:
montant_total.loc[montant_total.index==max(maxmois.index)]
montant_total

Date_purchase
11    670572.0
12    541931.0
10    483989.0
9     412230.0
8     404342.0
3     390248.0
1     372940.0
4     346718.0
7     338690.0
5     338582.0
2     329738.0
6     296689.0
Name: Price, dtype: float64

In [103]:
plt.plot(montant_total,montant_total.index)

<div class="alert alert-block alert-info">
<b>10. Pour chaque client, Créer les variables suivantes :Fréquence ,  Récence,  Longueur ,  Montant,  NbrP1 , NbrP2 ,  Inter_achat </b>
</div>

In [77]:
newdta=mydf.groupby('Customer_ID').agg(Frequence=('Customer_ID','count'),
                                       Recence=('Date_purchase',lambda x: (x.max() -pd.to_datetime('2013/11/01')).days),
                                       Longueur=('Date_purchase',lambda y: (max(y)-min(y)).days),
                                       Montant=('Price','sum'),
                                       NbrP1=('Date_purchase',lambda z:  (z<= pd.to_datetime('2014/07/01')).sum()),
                                       NbrP2=('Date_purchase',lambda e:  ((e>= pd.to_datetime('2014/07/01')) &(e<= pd.to_datetime('2015/02/28'))).sum()) ,
                                       Inter_achat=('Date_purchase',lambda z:(max(z)-min(z)).days/(z.count()-1)
                                                    
                                                     if z.count()>1 else (max(z)-min(z)).days
                                       
    ))

<div class="alert alert-block alert-info">
<b>11. Afficher les statistiques descriptives de base (min, max, moyenne, ecart type) pour les
variables Longueur, Récence, Fréquence et Montant.</b>
</div>

In [78]:
newdta[['Longueur', 'Recence', 'Frequence', 'Montant','NbrP1','NbrP2']].describe().loc[['min','max','mean','std']]

        Longueur     Recence  Frequence       Montant      NbrP1      NbrP2
min     0.000000    1.000000   1.000000     69.000000   0.000000   0.000000
max   440.000000  454.000000  20.000000  14805.000000  19.000000  19.000000
mean  143.068725  273.792662   7.388468   2869.347117   3.957484   3.447874
std   117.364438  135.632311   5.387972   2834.170644   3.766177   4.561071

### PART 2

<div class="alert alert-block alert-info">
<b>1. Comment interpréter la valeur 0 dans la colonne Inter_achat ? Remplacer cette valeur par
la valeur moyenne de cette colonne (en prenant en compte que les valeurs différentes à
zéro).</b>
</div>

<div class="alert alert-block alert-success">
<b>Interpretation des résultat</b>
</div>

<div class="alert alert-block alert-warning">
<b> Le client faite une seul achat</b> 
    
</div>

In [79]:
newdta.loc[newdta['Inter_achat']==0,'Inter_achat']=newdta.loc[newdta['Inter_achat']!=0,'Inter_achat'].mean()

In [80]:
newdta

             Frequence  Recence  Longueur  Montant  NbrP1  NbrP2  Inter_achat
Customer_ID
1                    1        1         0     69.0      1      0    41.573700
2                    1        3         0    350.0      1      0    41.573700
3                    1        4         0     69.0      1      0    41.573700
4                    1        6         0    120.0      1      0    41.573700
5                    1        6         0    120.0      1      0    41.573700
...                ...      ...       ...      ...    ...    ...          ...
1713                 3      394       260   1464.0      2      1   130.000000
1714                 5       59        22    951.0      5      0     5.500000
1715                12      405       399   2616.0      6      6    36.272727
1716                 5      155        44   2888.0      5      0    11.000000
1717                 2       92         9   1380.0      2      0     9.000000

[1717 rows x 7 columns]

<div class="alert alert-block alert-info">
<b>2. Sauvegarder le data frame final sous le nom "LRFMP1P2IT.xlsx".</b>
</div>

In [81]:
newdta.to_excel('LRFMP1P2IT.xlsx')